Public Attributes | List of all members
API_SkeletonOptions Struct Reference
View Handling
Skeleton drawing options. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_ViewSourceID  | viewSrc
Skeleton view source.
short  | floorIdx
Skeleton source floor index.
double  | cutHeight
Cut height (on the source floor).
short  | floorOffset
Floor offset to the other cutplane.
double  | cutOffset
Cut height (on the " @c floorIdx + @c floorOffset " floor).
short  | filler
Detailed Description
Skeleton drawing options.
Member Data Documentation
◆ cutHeight
 API_SkeletonOptions::cutHeight
Cut height (on the source floor).
◆ cutOffset
 API_SkeletonOptions::cutOffset
Cut height (on the " @c floorIdx + @c floorOffset " floor).
◆ filler
 short API_SkeletonOptions::filler
◆ floorIdx
 API_SkeletonOptions::floorIdx
Skeleton source floor index.
◆ floorOffset
 API_SkeletonOptions::floorOffset
Floor offset to the other cutplane.
◆ viewSrc
 API_SkeletonOptions::viewSrc
Skeleton view source.